app/controllers/users_controller.rb

SELECT * FROM `users`
---
  def index
    @users = User.all

SELECT * FROM `users` WHERE (`users`.`id` = 1)
---
  def show
    @user = User.find(params[:id])

SELECT * FROM `users` WHERE (`users`.`id` = 1)
---
  def edit
    @user = User.find(params[:id])

INSERT INTO `users` (`city`, `updated_at`, `zipcode`, `country_id`, `firstname`, `lastname`, `street`, `created_at`) VALUES('user[city]', '2009-06-20 16:36:34', '1111aa', 1, 'user[firstname]', 'user[lastname]', 'user[street]', '2009-06-20 16:36:34')
---
  def create
    @user = User.new(params[:user])

    respond_to do |format|
      if @user.save

SELECT * FROM `users` WHERE (`users`.`id` = 1)
UPDATE `users` SET `city` = 'user[city]2', `zipcode` = '1024BJ', `updated_at` = '2009-06-20 23:46:21' WHERE `id` = 1
---
  def update
    @user = User.find(params[:id])

    respond_to do |format|
      if @user.update_attributes(params[:user])

SELECT * FROM `users` WHERE (`users`.`id` = 4)
DELETE FROM `users` WHERE `id` = 4
---
  def destroy
    if request.delete?
      @user = User.find(params[:id])
      @user.destroy